---
source: crates/biome_js_analyze/tests/spec_tests.rs
expression: invalid.js
---
# Input
```jsx
a["b"];
a.b["c"];
a.b["c"].d.e["f"];
a.b[`c`];
a.b[c["d"]];
a["b"] = "something";
a.b["c"] = "something";
a.b["c"].d.e["f"] = "something";
a.b[`c`] = "something";
a.b[c["d"]] = "something";
a = {
	['b']: d
};
a = {
	[`b`]: d
};
a.b[`$c`];
a.b["_d"];
class C { ["a"] = 0 }
class C { ["a"](){} }
class C { get ["a"](){} }
class C { set ["a"](x){} }
a = {
	["1+1"]: 2
}
a = {
	[`1+1`]: 2
}
a = {
	[""]: 2
}

// optional chain
a?.["b"]?.['c']?.d?.e?.["f"]

```

# Diagnostics
```
invalid.js:1:3 lint/complexity/useLiteralKeys  FIXABLE  ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━

  ! The computed expression can be simplified without the use of a string literal.
  
  > 1 │ a["b"];
      │   ^^^
    2 │ a.b["c"];
    3 │ a.b["c"].d.e["f"];
  
  i Unsafe fix: Use a literal key instead.
  
     1    │ - a["b"];
        1 │ + a.b;
     2  2 │   a.b["c"];
     3  3 │   a.b["c"].d.e["f"];
  

```

```
invalid.js:2:5 lint/complexity/useLiteralKeys  FIXABLE  ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━

  ! The computed expression can be simplified without the use of a string literal.
  
    1 │ a["b"];
  > 2 │ a.b["c"];
      │     ^^^
    3 │ a.b["c"].d.e["f"];
    4 │ a.b[`c`];
  
  i Unsafe fix: Use a literal key instead.
  
     1  1 │   a["b"];
     2    │ - a.b["c"];
        2 │ + a.b.c;
     3  3 │   a.b["c"].d.e["f"];
     4  4 │   a.b[`c`];
  

```

```
invalid.js:3:5 lint/complexity/useLiteralKeys  FIXABLE  ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━

  ! The computed expression can be simplified without the use of a string literal.
  
    1 │ a["b"];
    2 │ a.b["c"];
  > 3 │ a.b["c"].d.e["f"];
      │     ^^^
    4 │ a.b[`c`];
    5 │ a.b[c["d"]];
  
  i Unsafe fix: Use a literal key instead.
  
     1  1 │   a["b"];
     2  2 │   a.b["c"];
     3    │ - a.b["c"].d.e["f"];
        3 │ + a.b.c.d.e["f"];
     4  4 │   a.b[`c`];
     5  5 │   a.b[c["d"]];
  

```

```
invalid.js:3:14 lint/complexity/useLiteralKeys  FIXABLE  ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━

  ! The computed expression can be simplified without the use of a string literal.
  
    1 │ a["b"];
    2 │ a.b["c"];
  > 3 │ a.b["c"].d.e["f"];
      │              ^^^
    4 │ a.b[`c`];
    5 │ a.b[c["d"]];
  
  i Unsafe fix: Use a literal key instead.
  
     1  1 │   a["b"];
     2  2 │   a.b["c"];
     3    │ - a.b["c"].d.e["f"];
        3 │ + a.b["c"].d.e.f;
     4  4 │   a.b[`c`];
     5  5 │   a.b[c["d"]];
  

```

```
invalid.js:4:5 lint/complexity/useLiteralKeys  FIXABLE  ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━

  ! The computed expression can be simplified without the use of a string literal.
  
    2 │ a.b["c"];
    3 │ a.b["c"].d.e["f"];
  > 4 │ a.b[`c`];
      │     ^^^
    5 │ a.b[c["d"]];
    6 │ a["b"] = "something";
  
  i Unsafe fix: Use a literal key instead.
  
     2  2 │   a.b["c"];
     3  3 │   a.b["c"].d.e["f"];
     4    │ - a.b[`c`];
        4 │ + a.b.c;
     5  5 │   a.b[c["d"]];
     6  6 │   a["b"] = "something";
  

```

```
invalid.js:5:7 lint/complexity/useLiteralKeys  FIXABLE  ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━

  ! The computed expression can be simplified without the use of a string literal.
  
    3 │ a.b["c"].d.e["f"];
    4 │ a.b[`c`];
  > 5 │ a.b[c["d"]];
      │       ^^^
    6 │ a["b"] = "something";
    7 │ a.b["c"] = "something";
  
  i Unsafe fix: Use a literal key instead.
  
     3  3 │   a.b["c"].d.e["f"];
     4  4 │   a.b[`c`];
     5    │ - a.b[c["d"]];
        5 │ + a.b[c.d];
     6  6 │   a["b"] = "something";
     7  7 │   a.b["c"] = "something";
  

```

```
invalid.js:6:3 lint/complexity/useLiteralKeys  FIXABLE  ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━

  ! The computed expression can be simplified without the use of a string literal.
  
    4 │ a.b[`c`];
    5 │ a.b[c["d"]];
  > 6 │ a["b"] = "something";
      │   ^^^
    7 │ a.b["c"] = "something";
    8 │ a.b["c"].d.e["f"] = "something";
  
  i Unsafe fix: Use a literal key instead.
  
     4  4 │   a.b[`c`];
     5  5 │   a.b[c["d"]];
     6    │ - a["b"]·=·"something";
        6 │ + a.b·=·"something";
     7  7 │   a.b["c"] = "something";
     8  8 │   a.b["c"].d.e["f"] = "something";
  

```

```
invalid.js:7:5 lint/complexity/useLiteralKeys  FIXABLE  ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━

  ! The computed expression can be simplified without the use of a string literal.
  
    5 │ a.b[c["d"]];
    6 │ a["b"] = "something";
  > 7 │ a.b["c"] = "something";
      │     ^^^
    8 │ a.b["c"].d.e["f"] = "something";
    9 │ a.b[`c`] = "something";
  
  i Unsafe fix: Use a literal key instead.
  
     5  5 │   a.b[c["d"]];
     6  6 │   a["b"] = "something";
     7    │ - a.b["c"]·=·"something";
        7 │ + a.b.c·=·"something";
     8  8 │   a.b["c"].d.e["f"] = "something";
     9  9 │   a.b[`c`] = "something";
  

```

```
invalid.js:8:5 lint/complexity/useLiteralKeys  FIXABLE  ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━

  ! The computed expression can be simplified without the use of a string literal.
  
     6 │ a["b"] = "something";
     7 │ a.b["c"] = "something";
   > 8 │ a.b["c"].d.e["f"] = "something";
       │     ^^^
     9 │ a.b[`c`] = "something";
    10 │ a.b[c["d"]] = "something";
  
  i Unsafe fix: Use a literal key instead.
  
     6  6 │   a["b"] = "something";
     7  7 │   a.b["c"] = "something";
     8    │ - a.b["c"].d.e["f"]·=·"something";
        8 │ + a.b.c.d.e["f"]·=·"something";
     9  9 │   a.b[`c`] = "something";
    10 10 │   a.b[c["d"]] = "something";
  

```

```
invalid.js:8:14 lint/complexity/useLiteralKeys  FIXABLE  ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━

  ! The computed expression can be simplified without the use of a string literal.
  
     6 │ a["b"] = "something";
     7 │ a.b["c"] = "something";
   > 8 │ a.b["c"].d.e["f"] = "something";
       │              ^^^
     9 │ a.b[`c`] = "something";
    10 │ a.b[c["d"]] = "something";
  
  i Unsafe fix: Use a literal key instead.
  
     6  6 │   a["b"] = "something";
     7  7 │   a.b["c"] = "something";
     8    │ - a.b["c"].d.e["f"]·=·"something";
        8 │ + a.b["c"].d.e.f·=·"something";
     9  9 │   a.b[`c`] = "something";
    10 10 │   a.b[c["d"]] = "something";
  

```

```
invalid.js:9:5 lint/complexity/useLiteralKeys  FIXABLE  ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━

  ! The computed expression can be simplified without the use of a string literal.
  
     7 │ a.b["c"] = "something";
     8 │ a.b["c"].d.e["f"] = "something";
   > 9 │ a.b[`c`] = "something";
       │     ^^^
    10 │ a.b[c["d"]] = "something";
    11 │ a = {
  
  i Unsafe fix: Use a literal key instead.
  
     7  7 │   a.b["c"] = "something";
     8  8 │   a.b["c"].d.e["f"] = "something";
     9    │ - a.b[`c`]·=·"something";
        9 │ + a.b.c·=·"something";
    10 10 │   a.b[c["d"]] = "something";
    11 11 │   a = {
  

```

```
invalid.js:10:7 lint/complexity/useLiteralKeys  FIXABLE  ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━

  ! The computed expression can be simplified without the use of a string literal.
  
     8 │ a.b["c"].d.e["f"] = "something";
     9 │ a.b[`c`] = "something";
  > 10 │ a.b[c["d"]] = "something";
       │       ^^^
    11 │ a = {
    12 │ 	['b']: d
  
  i Unsafe fix: Use a literal key instead.
  
     8  8 │   a.b["c"].d.e["f"] = "something";
     9  9 │   a.b[`c`] = "something";
    10    │ - a.b[c["d"]]·=·"something";
       10 │ + a.b[c.d]·=·"something";
    11 11 │   a = {
    12 12 │   	['b']: d
  

```

```
invalid.js:12:3 lint/complexity/useLiteralKeys  FIXABLE  ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━

  ! The computed expression can be simplified without the use of a string literal.
  
    10 │ a.b[c["d"]] = "something";
    11 │ a = {
  > 12 │ 	['b']: d
       │ 	 ^^^
    13 │ };
    14 │ a = {
  
  i Unsafe fix: Use a literal key instead.
  
    10 10 │   a.b[c["d"]] = "something";
    11 11 │   a = {
    12    │ - → ['b']:·d
       12 │ + → "b":·d
    13 13 │   };
    14 14 │   a = {
  

```

```
invalid.js:15:3 lint/complexity/useLiteralKeys  FIXABLE  ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━

  ! The computed expression can be simplified without the use of a string literal.
  
    13 │ };
    14 │ a = {
  > 15 │ 	[`b`]: d
       │ 	 ^^^
    16 │ };
    17 │ a.b[`$c`];
  
  i Unsafe fix: Use a literal key instead.
  
    13 13 │   };
    14 14 │   a = {
    15    │ - → [`b`]:·d
       15 │ + → "b":·d
    16 16 │   };
    17 17 │   a.b[`$c`];
  

```

```
invalid.js:17:5 lint/complexity/useLiteralKeys  FIXABLE  ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━

  ! The computed expression can be simplified without the use of a string literal.
  
    15 │ 	[`b`]: d
    16 │ };
  > 17 │ a.b[`$c`];
       │     ^^^^
    18 │ a.b["_d"];
    19 │ class C { ["a"] = 0 }
  
  i Unsafe fix: Use a literal key instead.
  
    15 15 │   	[`b`]: d
    16 16 │   };
    17    │ - a.b[`$c`];
       17 │ + a.b.$c;
    18 18 │   a.b["_d"];
    19 19 │   class C { ["a"] = 0 }
  

```

```
invalid.js:18:5 lint/complexity/useLiteralKeys  FIXABLE  ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━

  ! The computed expression can be simplified without the use of a string literal.
  
    16 │ };
    17 │ a.b[`$c`];
  > 18 │ a.b["_d"];
       │     ^^^^
    19 │ class C { ["a"] = 0 }
    20 │ class C { ["a"](){} }
  
  i Unsafe fix: Use a literal key instead.
  
    16 16 │   };
    17 17 │   a.b[`$c`];
    18    │ - a.b["_d"];
       18 │ + a.b._d;
    19 19 │   class C { ["a"] = 0 }
    20 20 │   class C { ["a"](){} }
  

```

```
invalid.js:19:12 lint/complexity/useLiteralKeys  FIXABLE  ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━

  ! The computed expression can be simplified without the use of a string literal.
  
    17 │ a.b[`$c`];
    18 │ a.b["_d"];
  > 19 │ class C { ["a"] = 0 }
       │            ^^^
    20 │ class C { ["a"](){} }
    21 │ class C { get ["a"](){} }
  
  i Unsafe fix: Use a literal key instead.
  
    19 │ class·C·{·["a"]·=·0·}
       │           -   -      

```

```
invalid.js:20:12 lint/complexity/useLiteralKeys  FIXABLE  ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━

  ! The computed expression can be simplified without the use of a string literal.
  
    18 │ a.b["_d"];
    19 │ class C { ["a"] = 0 }
  > 20 │ class C { ["a"](){} }
       │            ^^^
    21 │ class C { get ["a"](){} }
    22 │ class C { set ["a"](x){} }
  
  i Unsafe fix: Use a literal key instead.
  
    20 │ class·C·{·["a"](){}·}
       │           -   -      

```

```
invalid.js:21:16 lint/complexity/useLiteralKeys  FIXABLE  ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━

  ! The computed expression can be simplified without the use of a string literal.
  
    19 │ class C { ["a"] = 0 }
    20 │ class C { ["a"](){} }
  > 21 │ class C { get ["a"](){} }
       │                ^^^
    22 │ class C { set ["a"](x){} }
    23 │ a = {
  
  i Unsafe fix: Use a literal key instead.
  
    21 │ class·C·{·get·["a"](){}·}
       │               -   -      

```

```
invalid.js:22:16 lint/complexity/useLiteralKeys  FIXABLE  ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━

  ! The computed expression can be simplified without the use of a string literal.
  
    20 │ class C { ["a"](){} }
    21 │ class C { get ["a"](){} }
  > 22 │ class C { set ["a"](x){} }
       │                ^^^
    23 │ a = {
    24 │ 	["1+1"]: 2
  
  i Unsafe fix: Use a literal key instead.
  
    22 │ class·C·{·set·["a"](x){}·}
       │               -   -       

```

```
invalid.js:24:3 lint/complexity/useLiteralKeys  FIXABLE  ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━

  ! The computed expression can be simplified without the use of a string literal.
  
    22 │ class C { set ["a"](x){} }
    23 │ a = {
  > 24 │ 	["1+1"]: 2
       │ 	 ^^^^^
    25 │ }
    26 │ a = {
  
  i Unsafe fix: Use a literal key instead.
  
    24 │ → ["1+1"]:·2
       │   -     -   

```

```
invalid.js:27:3 lint/complexity/useLiteralKeys  FIXABLE  ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━

  ! The computed expression can be simplified without the use of a string literal.
  
    25 │ }
    26 │ a = {
  > 27 │ 	[`1+1`]: 2
       │ 	 ^^^^^
    28 │ }
    29 │ a = {
  
  i Unsafe fix: Use a literal key instead.
  
    25 25 │   }
    26 26 │   a = {
    27    │ - → [`1+1`]:·2
       27 │ + → "1+1":·2
    28 28 │   }
    29 29 │   a = {
  

```

```
invalid.js:30:3 lint/complexity/useLiteralKeys  FIXABLE  ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━

  ! The computed expression can be simplified without the use of a string literal.
  
    28 │ }
    29 │ a = {
  > 30 │ 	[""]: 2
       │ 	 ^^
    31 │ }
    32 │ 
  
  i Unsafe fix: Use a literal key instead.
  
    30 │ → [""]:·2
       │   -  -   

```

```
invalid.js:34:5 lint/complexity/useLiteralKeys  FIXABLE  ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━

  ! The computed expression can be simplified without the use of a string literal.
  
    33 │ // optional chain
  > 34 │ a?.["b"]?.['c']?.d?.e?.["f"]
       │     ^^^
    35 │ 
  
  i Unsafe fix: Use a literal key instead.
  
    34 │ a?.["b"]?.['c']?.d?.e?.["f"]
       │    -- --                    

```

```
invalid.js:34:12 lint/complexity/useLiteralKeys  FIXABLE  ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━

  ! The computed expression can be simplified without the use of a string literal.
  
    33 │ // optional chain
  > 34 │ a?.["b"]?.['c']?.d?.e?.["f"]
       │            ^^^
    35 │ 
  
  i Unsafe fix: Use a literal key instead.
  
    34 │ a?.["b"]?.['c']?.d?.e?.["f"]
       │           -- --             

```

```
invalid.js:34:25 lint/complexity/useLiteralKeys  FIXABLE  ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━

  ! The computed expression can be simplified without the use of a string literal.
  
    33 │ // optional chain
  > 34 │ a?.["b"]?.['c']?.d?.e?.["f"]
       │                         ^^^
    35 │ 
  
  i Unsafe fix: Use a literal key instead.
  
    34 │ a?.["b"]?.['c']?.d?.e?.["f"]
       │                        -- --

```
