---
source: crates/biome_js_analyze/tests/spec_tests.rs
expression: invalid.ts
snapshot_kind: text
---
# Input
```ts
export interface I {
	["p1"]: number

	get ["p2"](): number

	set ["p2"](x: number)

	["m1"](): void

	[""]: number
}

export type T = {
	["p1"]: number

	get ["p2"](): number

	set ["p2"](x: number)

	["m1"](): void

	[""]: number
}

export enum E {
	["A"],
	["B"],
}

```

# Diagnostics
```
invalid.ts:2:3 lint/complexity/useLiteralKeys  FIXABLE  ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━

  × The computed expression can be simplified to a string literal.
  
    1 │ export interface I {
  > 2 │ 	["p1"]: number
      │ 	 ^^^^
    3 │ 
    4 │ 	get ["p2"](): number
  
  i Unsafe fix: Use a literal key instead.
  
    2 │ → ["p1"]:·number
      │   -    -        

```

```
invalid.ts:4:7 lint/complexity/useLiteralKeys  FIXABLE  ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━

  × The computed expression can be simplified to a string literal.
  
    2 │ 	["p1"]: number
    3 │ 
  > 4 │ 	get ["p2"](): number
      │ 	     ^^^^
    5 │ 
    6 │ 	set ["p2"](x: number)
  
  i Unsafe fix: Use a literal key instead.
  
    4 │ → get·["p2"]():·number
      │       -    -          

```

```
invalid.ts:6:7 lint/complexity/useLiteralKeys  FIXABLE  ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━

  × The computed expression can be simplified to a string literal.
  
    4 │ 	get ["p2"](): number
    5 │ 
  > 6 │ 	set ["p2"](x: number)
      │ 	     ^^^^
    7 │ 
    8 │ 	["m1"](): void
  
  i Unsafe fix: Use a literal key instead.
  
    6 │ → set·["p2"](x:·number)
      │       -    -           

```

```
invalid.ts:8:3 lint/complexity/useLiteralKeys  FIXABLE  ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━

  × The computed expression can be simplified to a string literal.
  
     6 │ 	set ["p2"](x: number)
     7 │ 
   > 8 │ 	["m1"](): void
       │ 	 ^^^^
     9 │ 
    10 │ 	[""]: number
  
  i Unsafe fix: Use a literal key instead.
  
    8 │ → ["m1"]():·void
      │   -    -        

```

```
invalid.ts:10:3 lint/complexity/useLiteralKeys  FIXABLE  ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━

  × The computed expression can be simplified to a string literal.
  
     8 │ 	["m1"](): void
     9 │ 
  > 10 │ 	[""]: number
       │ 	 ^^
    11 │ }
    12 │ 
  
  i Unsafe fix: Use a literal key instead.
  
    10 │ → [""]:·number
       │   -  -        

```

```
invalid.ts:14:3 lint/complexity/useLiteralKeys  FIXABLE  ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━

  × The computed expression can be simplified to a string literal.
  
    13 │ export type T = {
  > 14 │ 	["p1"]: number
       │ 	 ^^^^
    15 │ 
    16 │ 	get ["p2"](): number
  
  i Unsafe fix: Use a literal key instead.
  
    14 │ → ["p1"]:·number
       │   -    -        

```

```
invalid.ts:16:7 lint/complexity/useLiteralKeys  FIXABLE  ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━

  × The computed expression can be simplified to a string literal.
  
    14 │ 	["p1"]: number
    15 │ 
  > 16 │ 	get ["p2"](): number
       │ 	     ^^^^
    17 │ 
    18 │ 	set ["p2"](x: number)
  
  i Unsafe fix: Use a literal key instead.
  
    16 │ → get·["p2"]():·number
       │       -    -          

```

```
invalid.ts:18:7 lint/complexity/useLiteralKeys  FIXABLE  ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━

  × The computed expression can be simplified to a string literal.
  
    16 │ 	get ["p2"](): number
    17 │ 
  > 18 │ 	set ["p2"](x: number)
       │ 	     ^^^^
    19 │ 
    20 │ 	["m1"](): void
  
  i Unsafe fix: Use a literal key instead.
  
    18 │ → set·["p2"](x:·number)
       │       -    -           

```

```
invalid.ts:20:3 lint/complexity/useLiteralKeys  FIXABLE  ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━

  × The computed expression can be simplified to a string literal.
  
    18 │ 	set ["p2"](x: number)
    19 │ 
  > 20 │ 	["m1"](): void
       │ 	 ^^^^
    21 │ 
    22 │ 	[""]: number
  
  i Unsafe fix: Use a literal key instead.
  
    20 │ → ["m1"]():·void
       │   -    -        

```

```
invalid.ts:22:3 lint/complexity/useLiteralKeys  FIXABLE  ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━

  × The computed expression can be simplified to a string literal.
  
    20 │ 	["m1"](): void
    21 │ 
  > 22 │ 	[""]: number
       │ 	 ^^
    23 │ }
    24 │ 
  
  i Unsafe fix: Use a literal key instead.
  
    22 │ → [""]:·number
       │   -  -        

```

```
invalid.ts:26:3 lint/complexity/useLiteralKeys  FIXABLE  ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━

  × The computed expression can be simplified to a string literal.
  
    25 │ export enum E {
  > 26 │ 	["A"],
       │ 	 ^^^
    27 │ 	["B"],
    28 │ }
  
  i Unsafe fix: Use a literal key instead.
  
    26 │ → ["A"],
       │   -   - 

```

```
invalid.ts:27:3 lint/complexity/useLiteralKeys  FIXABLE  ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━

  × The computed expression can be simplified to a string literal.
  
    25 │ export enum E {
    26 │ 	["A"],
  > 27 │ 	["B"],
       │ 	 ^^^
    28 │ }
    29 │ 
  
  i Unsafe fix: Use a literal key instead.
  
    27 │ → ["B"],
       │   -   - 

```
